Repository: hooloowoo/biorhythm-flutter-app
Catalog: lib/l10n/app_*.arb
Languages: hu

# appTitle
source: Biorhythm Calculator
hu: Bioritmus Kalkulátor

source: Birth Date
hu: Születési Dátum

source: Analysis Date
hu: Elemzési Dátum

source: Select Birth Date
hu: Születési Dátum Kiválasztása

source: Select Date
hu: Dátum Kiválasztása

source: Not selected
hu: Nincs kiválasztva

# selectBirthDateHelp
source: Please select your birth date
hu: Kérjük, válassza ki a születési dátumát

# selectAnalysisDateHelp
source: Please select the date to analyze
hu: Kérjük, válassza ki az elemzendő dátumot

source: Biorhythm Chart
hu: Bioritmus Grafikon

source: Biorhythm Analysis
hu: Bioritmus Elemzés

# pleaseSelectBirthDate
source: Please select your birth date to see the biorhythm chart.
hu: Kérjük, válassza ki a születési dátumát a bioritmus grafikon megtekintéséhez.

source: Physical
hu: Fizikai

source: Emotional
hu: Érzelmi

source: Intellectual
hu: Szellemi

source: High
hu: Magas

source: Medium
hu: Közepes

source: Low
hu: Alacsony

source: Analysis Description
hu: Elemzés Leírása

# biorhythmAnalysisFor
source: Biorhythm Analysis for {date}
hu: Bioritmus Elemzés {date} dátumra

# physicalDescription
source: The physical cycle affects your energy, strength, and overall physical well-being.
hu: A fizikai ciklus befolyásolja az energiáját, erejét és általános fizikai jóllétét.

# emotionalDescription
source: The emotional cycle influences your mood, creativity, and emotional stability.
hu: Az érzelmi ciklus befolyásolja a hangulatát, kreativitását és érzelmi stabilitását.

# intellectualDescription
source: The intellectual cycle impacts your analytical thinking, decision-making, and mental clarity.
hu: A szellemi ciklus hatással van az analitikus gondolkodására, döntéshozatalára és mentális tisztaságára.

# chartDescription
source: The chart shows your biorhythm cycles over time. Touch or tap the lines to see exact values.
hu: A grafikon az időbeli bioritmus ciklusokat mutatja. Érintse meg a vonalakat a pontos értékek megtekintéséhez.

source: Birthdate
hu: Szül. dátum

source: Name
hu: Név

source: Settings
hu: Beállítások

source: Actual date
hu: Aktuális dátum

source: Profiles
hu: Profilok

# addItem
source: New profile
hu: Új profil

# mainTitle
source: Biorhythm
hu: Bioritmus

# descrPhysicalMax
source: During this period, your physical activity level increases. Your body feels energetic and vital, and you can perform physical activities with stamina. Additionally, your sexual activity may increase during this time. It is the best time for physical work, sports, sex, and medical interventions.
hu: Ebben az időszakban fokozott a fizikai szintű aktivitásod. A tested energikus, életteli, képes vagy kitartóan végezni fizikai tevékenységeket, fokozódhat a szexuális aktivitásod. A legjobb időszak a fizikai munkához, a sportoláshoz, a szexhez, az orvosi beavatkozásokhoz.

# descrPhysicalMid
source: During this period, it is important to prioritize your physical health. Therefore, it is essential to avoid injuries while engaging in physical activities. Take special care while using tools, driving, and operating machinery to prevent accidents. If possible, try to minimize any potential sources of danger. It is also advisable to avoid medical interventions or travel unless necessary.
hu: Ez az időszak kritikus a fizikai, testi épséged szempontjából. Légy óvatos a fizikai tevékenységeid során, hogy meg ne sérülj! Ügyelj az eszközhasználatra, a járművezetésre és gépkezelésre. Ha lehet, minimalizáld a veszélyforrásokat. Az orvosi beavatkozások, utazások kerülendők.

# descrPhysicalMin
source: During this period, you may experience decreased physical and sexual activity, tiredness, deteriorating coordination, and sickness. It is recommended to reduce physical work and avoid alcohol consumption if possible.
hu: Ebben az időszakban csökken a fizikai és a szexuális aktivitásod. Fáradtnak érezheted magad, romlik a mozgáskoordinációd, akár meg is betegedhetsz. Ha lehet, csökkentsd a fizikai munkát, és kerüld az alkoholfogyasztást.

# descrEmotionalMax
source: During this period, you may experience contentment, motivation, enthusiasm, and eagerness to create and love. However, you may also have heightened sensitivity, which can cause you to react quickly to extremes in your relationships. If you experience a lack of peace and coldness in your relationships, it may trigger an adverse reaction.
hu: Ebben az időszakban elégedettnek érzed magad, motivált és lelkes lehetsz, alkotni és szeretni vágysz. Ugyanakkor fokozott az érzékenységed. Emiatt a kapcsolataidban könnyen reagálhatsz szélsőségesen, ha békétlenséget és ridegséget tapasztalsz.

# descrEmotionalMid
source: During this period, it may be difficult to manage emotions, and occasional outbursts may occur.
hu: Ezekben a napokban nehezebben kontrollálod az érzelmeidet. Hajlamos lehetsz érzelmi kitörésekre.

# descrEmotionalMin
source: During this period, individuals may experience decreased energy levels, increased irritability, and apathy. Women and creative types may be particularly susceptible. This period may not be optimal for relationships, particularly romantic ones.
hu: Ebben az időszakban csökken az életkedved, ingerlékenyebb lehetsz, és hajlamosabb az apátiára. A nők és a kreatív emberek erre általában érzékenyebbek. Ez a pár nap az emberi kapcsolatok, különösen a szerelem szempontjából nem túl kedvező.

# descrIntellectualMax
source: During this period, your creativity and mental activity will increase. You can quickly solve complicated issues, and it is an excellent time to make important decisions, deals, and contracts.
hu: Ebben az időszakban fokozódik a kreativitásod és a mentális aktivitásod. Bonyolult ügyeket is könnyedén megoldasz. Most érdemes üzletet, szerződést kötni, és meghozni a fontos döntéseidet.

# descrIntellectualMid
source: During this period, you may find yourself unable to concentrate, making impulsive decisions and having unrealistic, useless, unrealistic ideas. Don't expect too much from yourself intellectually.
hu: Ezekben a napokban szórakozott, dekoncentrált lehetsz, és meggondolatlan döntéseket hozhatsz. Irreális és haszontalan, vagy megvalósíthatatlan ötleteid támadhatnak. Intellektuális téren ne várj magadtól túl sokat.

# descrIntellectualMin
source: During this period, you may experience a decrease in your mental capacity, making it difficult to think and remember things. It's advisable to avoid making any important decisions, such as signing a contract, making a deal, or starting a new project. Instead, engage in activities that don't require too much thinking.
hu: Ebben az időszakban csökkenhet a mentális kapacitásod, nehezebben megy a gondolkodás, rosszabb lehet a memóriád. Ha lehet, he most köss üzletet, ne írj alá szerződéseket, és ne most kezdj valami új ötlet megvalósításába. A legjobb, ha gondolkozást nem igénylő dolgokkal foglalkozol.

source: Detailed Analysis
hu: Részletes Elemzés

source: Physical Cycle
hu: Fizikai Ciklus

source: Emotional Cycle
hu: Érzelmi Ciklus

source: Intellectual Cycle
hu: Szellemi Ciklus
